Revit 2026 API

# ExportLineweightTableIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<ExportLineweightKey, ExportLineweightInfo> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportLineweightKey, ExportLineweightInfo)
	Get
```
```cpp
public:
virtual property KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^> Current {
	KeyValuePair<ExportLineweightKey^, ExportLineweightInfo^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<ExportLineweightKey, ExportLineweightInfo> with get
override Current : KeyValuePair<ExportLineweightKey, ExportLineweightInfo> with get
```

#### Property Value

KeyValuePairExportLineweightKey, ExportLineweightInfo

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ExportLineweightTableIterator Class

Autodesk.Revit.DB Namespace